app/controllers/accelerometer_controller.rb

SELECT "accelerometers".* FROM "accelerometers"
---
	def api
		@data = Accelerometer.all

INSERT INTO "accelerometers" ("time", "x", "y", "z", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["time", 1000], ["x", -9.8], ["y", 4.78], ["z", 1.0], ["created_at", 2016-11-11 19:29:52 UTC], ["updated_at", 2016-11-11 19:29:52 UTC], ["user_id", 1]]
---
	def add_to_api
		@accel = Accelerometer.new(api_params)
		respond_to do |format|
			if @accel.save