app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @patients = User.find(params[:id]).patients.all
    @other_patients = Patient.all - @patients
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "patients".* FROM "patients" INNER JOIN "patients_users" ON "patients"."id" = "patients_users"."patient_id" WHERE "patients_users"."user_id" = ?  [["user_id", 1]]
SELECT "patients".* FROM "patients"